ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g518x/UC1_UART_1.0.xml
    <register id="UC1_UART_RXDATA" width="32" offset="0x1124" description="UART Receive Data Register">
        <bitfield id="DATA" description="Received Data.  When read, this field contains the data that was received by the UART." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FRMERR" description="UART Framing Error  Writing to this bit has no effect. The flag is cleared by writing 1 to the FRMERR bit in the UART EVENT ICLR register. This error is associated with the character at the top of the FIFO." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No framing error has occurred"/>
            <bitenum id="SET" value="0x1" description="The received character does not have a valid stop bit sequence, which is one or two stop bits depending on the UARTLCRH.STP2 setting (a valid stop bit is 1)."/>
        </bitfield>
        <bitfield id="PARERR" description="UART Parity Error   Writing to this bit has no effect. The flag is cleared by writing 1 to the PARERR bit in the UART EVENT ICLR register." begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No parity error has occurred"/>
            <bitenum id="SET" value="0x1" description="The parity of the received data character does not match the parity defined by bits 2 and 7 of the UARTLCRH register."/>
        </bitfield>
        <bitfield id="BRKERR" description="UART Break Error  Writing to this bit has no effect. The flag is cleared by writing 1 to the BRKERR bit in the UART EVENT ICLR register. This error is associated with the character at the top of the FIFO. When a break occurs, only one 0 character is loaded into the FIFO. The next character is only enabled after the receive data input goes to a 1 (marking state) and the next valid start bit is received." begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No break condition has occurred"/>
            <bitenum id="SET" value="0x1" description="A break condition has been detected, indicating that the receive data input was held low for longer than a full-word transmission time (defined as start, data, parity, and stop bits)."/>
        </bitfield>
        <bitfield id="NERR" description="Noise Error.
Writing to this bit has no effect. The flag is cleared by writing 1 to the NERR bit in the UART EVENT ICLR register." begin="11" end="11" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No noise error occurred"/>
            <bitenum id="SET" value="0x1" description="Noise error occurred during majority voting"/>
        </bitfield>
    </register>
    <register id="UC1_UART_LINCNT" width="32" offset="0x1130" description="UART LIN Mode Counter Register">
        <bitfield id="VALUE" description="16 bit up counter clocked by the functional clock of the UART." begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC1_UART_LINCTL" width="32" offset="0x1134" description="UART LIN Mode Control Register">
        <bitfield id="CTRENA" description="LIN Counter Enable. LIN counter will only count when enabled." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Counter disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Counter enabled"/>
        </bitfield>
        <bitfield id="ZERONE" description="Zero on negative Edge of RXD. When enabled the counter is set to 0 and starts counting on a negative edge of RXD" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Zero on negative edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Zero on negative edge enabled"/>
        </bitfield>
        <bitfield id="CNTRXLOW" description="Count while low Signal on RXD When counter is enabled and the signal on RXD is low, the counter increments." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Count while low Signal on UARTxRXD disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Count while low Signal on UARTxRXD enabled"/>
        </bitfield>
        <bitfield id="LINC0CAP" description="Capture Counter on negative RXD Edge. When enabled the counter value is captured to LINC0 register on each negative RXD edge. A LINC0 interrupt is triggered when enabled." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Capture counter on negative UARTxRXD edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Capture counter on negative UARTxRXD edge enabled"/>
        </bitfield>
        <bitfield id="LINC1CAP" description="Capture Counter on positive RXD Edge. When enabled the counter value is captured to LINC1 register on each positive RXD edge. A LINC1 interrupt is triggered when enabled." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Capture counter on positive UARTxRXD edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Capture counter on positive UARTxRXD edge enabled"/>
        </bitfield>
        <bitfield id="LINC0_MATCH" description="Counter Compare Match Mode  When this bit is set to 1 a counter compare match with LINC0 register triggers an LINC0 interrupt when enabled." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Counter compare match mode disabled (capture mode enabled)"/>
            <bitenum id="ENABLE" value="0x1" description="Counter compare match enabled (capture mode disabled)"/>
        </bitfield>
    </register>
    <register id="UC1_UART_LINC0" width="32" offset="0x1138" description="UART LIN Mode Capture 0 Register">
        <bitfield id="DATA" description="16 Bit Capture / Compare Register 
Captures current LINCTR value on RXD falling edge and can generate a LINC0 interrupt when capture is enabled (LINC0CAP = 1).
If compare mode is enabled (LINC0_MATCH = 1), a counter match can generate a LINC0 interrupt." begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC1_UART_LINC1" width="32" offset="0x113C" description="UART LIN Mode Capture 1 Register">
        <bitfield id="DATA" description="16 Bit Capture / Compare Register 
Captures current LINCTR value on RXD rising edge and can generate a LINC1 interrupt when capture is enabled (LINC1CAP = 1)" begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC1_UART_AMASK" width="32" offset="0x1148" description="Self Address Mask Register">
        <bitfield id="MSK" description="Self Address Mask for 9-Bit Mode  This field contains the address mask that creates a set of addresses that should be matched.  A 0 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register is don't care. A 1 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register must match." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC1_UART_ADDR" width="32" offset="0x114C" description="Self Address Register">
        <bitfield id="ADDR" description="Self Address for 9-Bit Mode  This field contains the address that should be matched when UARTxAMASK is FFh." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>

</module>